In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [3]:
df1 = DataFrame(np.arange(9).reshape(3,3),\
               index=['BJ','SH','GZ'],columns=['c1','c2','c3'])
df1

    c1  c2  c3
BJ   0   1   2
SH   3   4   5
GZ   6   7   8

In [4]:
df1.index

Index(['BJ', 'SH', 'GZ'], dtype='object')

In [6]:
df1.index = Series(['bj','sh','gz'])
df1

    c1  c2  c3
bj   0   1   2
sh   3   4   5
gz   6   7   8

In [9]:
df1.index = df1.index.map(str.upper)
df1

    c1  c2  c3
BJ   0   1   2
SH   3   4   5
GZ   6   7   8

In [12]:
df1.rename(index=str.lower,columns=str.upper)

    C1  C2  C3
bj   0   1   2
sh   3   4   5
gz   6   7   8

In [13]:
df1

    c1  c2  c3
BJ   0   1   2
SH   3   4   5
GZ   6   7   8

In [16]:
df1.rename(index={'BJ':'beijing'},columns=str.upper)

         C1  C2  C3
beijing   0   1   2
SH        3   4   5
GZ        6   7   8

In [17]:
list1 = [1,2,3,4]
list2 = ['1','2','3','4']

['1', '2', '3', '4']

NameError: name 'y' is not defined

[1, 4, 9, 16, 25]

function

[1, 2, 3, [1, 2, 3]]